{
    "0": {
        "word": "anti-pattern",
        "meaning": "If we consider that a pattern represents a best practice, an anti-pattern represents a lesson that has been learned. What is wrong, why and how do we fix it. To summarize, an anti-pattern is a bad design that is worthy of documenting",
        "example": "inASentencePlaceholder",
        "tag": ["web", "DM"]
    },
    "1": {
        "word": "bitwise comparison",
        "meaning": "Simple comparison of values.",
        "example": "In JavaScript, you can use a double bitwise negation (~~n) as a replacement for Math.floor(n) (if n is a positive number) or parseInt(n, 10) (even if n is negative).",
        "tag": ["Web", "CS", "DM"]
    },
    "2": {
        "word": "albumen",
        "meaning": "Egg white which surrounds the yolk.",
        "example": "Whether it’s Crockford’s protective albumen or the dry and narrow minded confines of computer science classes, doctrine and dogma are the enemies of good JavaScript. The joy of JavaScript is rooted in its lack of rigidity and the infinite possibilities that this allows for. Natural languages hold the same promise.",
        "tag": ["gre", "web", "DM"]
    },
    "3": {
        "word": "isomorphic code",
        "meaning": "definitionPlaceHolder",
        "example": "inASentencePlaceholder",
        "tag": ["tagPlaceHolder"]
    },
    "4": {
        "word": "Dirty Checking",
        "meaning": "Dirty Checking",
        "example": "The process of checking every watch to detect the changes, is called dirty checking. There could be two scenarios. First –Get a watch from list, Check whether item has been changed, If there is no change in item then No Action taken. Move to next item in watch list. Second– Get a watch from list,Check whether item has been changed,If there is Change in an item,DOM needs to be updated,return to digest loop.--In second case,loop continues till it finds no changes in the entire loop.And once it completes DOM gets updated if required.",
        "tag": ["Angular"]
    },
    "5": {
        "word": "Digest Cycle",
        "meaning": "This cycle can be considered as a loop, during which Angular checks if there are any changes to all the variables watched by all the $scopes. So if you have $scope.myVar defined in your controller and this variable was marked for being watched, then you are explicitly telling Angular to monitor the changes on myVar in each iteration of the loop.",
        "example": "The process of checking every watch to detect the changes, is called dirty-checking. There could be two scenarios. First –Get a watch from list, Check whether item has been changed, If there is no change in item then No Action taken. Move to next item in watch list. Second– Get a watch from list, Check whether item has been changedIf there is Change in an item,DOM needs to be updated,return to digest loop.* * In second case,loop continues till it finds no changes in the entire loop.And once it completes DOM gets updated if required.",
        "tag": ["Web", "DM", "Angular"]
    },
    "6": {
        "word": "The Hollywood Principle",
        "meaning": "'Don't call me. I'll call you'...--Also 'Inversion of Control': The Dependency Injection pattern uses a builder object to initialize objects and provide the required dependencies to the object.",
        "example": "inASentencePlaceholder",
        "tag": ["DM", "CS", "Web"]
    },
    "7": {
        "word": "Dependency Injection",
        "meaning": "Each piece of code in a heirarchy specifies it's dependencies. In a Dependency Injection system, those dependencies are pre-resolved and passes (or injects) those dependencies into the heirarchy as needed. Code components register themselves and their needed dependencies",
        "example": "inASentencePlaceholder",
        "tag": ["DM", "CS", "Web"]
    },
    "8": {
        "word": "Shallow watch",
        "meaning": "$watchCollection will only watch the 'first level' of an array or object,",
        "example": "inASentencePlaceholder",
        "tag": ["Web", "DM"]
    },
    "9": {
        "word": "wordEntry",
        "meaning": "definitionPlaceHolder",
        "example": "inASentencePlaceholder",
        "tag": ["DM"]
    },
    "10": {
        "word": "Singleton",
        "meaning": "One copy only ever exists.",
        "example": "inASentencePlaceholder",
        "tag": ["DM"]
    },
    "11": {
        "word": "smarm",
        "meaning": "{ingratiating behavior.",
        "example": "inASentencePlaceholder",
        "tag": ["tagPlaceHolder"]
    },
    "12": {
        "word": "Selection Bias",
        "meaning": "Selection bias is the selection of individuals, groups or data for analysis in such a way that proper randomization is not achieved, thereby ensuring that the sample obtained is not representative of the population intended to be analyzed. It is sometimes referred to as the selection effect.",
        "example": "The selection bias inherent in the data dump from Wikileaks skews perceptions.",
        "tag": ["gre"]
    },
    "13": {
        "word": "Declarative HTML",
        "meaning": "HTML 5 is behavioral. Each link has an href that says what happens when you click it. Each form has an action that says what happens when you submit it. Select dropdowns open when you click them. Radio buttons and checkboxes toggle when you select them.",
        "example": "ng-controllers are Angular's way of exploiting the features of the behavioral features of HTML 5.",
        "tag": ["DM", "Web"]
    },
    "14": {
        "word": "2-way Data Binding",
        "meaning": "definitionPlaceHolder",
        "example": "in Angular. ng-click directives bind to {{tab}}. Upon click, tab's value gets updated in the page. So... if the UI is updated, so is the variable in the js. If the var in the js is updated, so is the UI",
        "tag": ["Web", "DM"]
    },
    "15": {
        "word": "V8",
        "meaning": "V8 is a JavaScript engine build in the google development center in Germany. It is open source and written in C++. It is used for both client side (Google Chrome) and server side (node.js) JavaScript applications",
        "example": "The part that reads the html css and js for chrome. For FFox its called spider-monkey. V8 parses out JavaScript and runs it.",
        "tag": ["Web", "CS", "DM"]
    },
    "16": {
        "word": "header",
        "meaning": "The meta-information that explains how to parse the messages sent recieved",
        "example": "inASentencePlaceholder",
        "tag": ["Web", "DM"]
    },
    "17": {
        "word": "regression analysis",
        "meaning": "In statistical modeling, regression analysis is a statistical process for estimating the relationships among variables.",
        "example": "A line of best fit in a scatter-plot may describe/predict a relationship between two variables (ie education and salary). The 'residual term' is a variable unaccounted for in the regression model (i.e. gender, height, race, etc.)",
        "tag": ["Web", "CS", "DM", "gre"]
    },
    "18": {
        "word": "Server",
        "meaning": "a computer.",
        "example": "The universal language http is the protocol used for servers and computers to talk to each other.",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "19": {
        "word": "NFS",
        "meaning": "The Network File System (NFS) is a client/server application that lets a computer user view and optionally store and update files on a remote computer as though they were on the user's own computer. The NFS protocol is one of several distributed file system standards for network-attached storage (NAS).",
        "example": "inASentencePlaceholder",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "20": {
        "word": "buffer",
        "meaning": "The buffer cache is used to cache all filesystem blocks, both disk and network based. Thus, NFS encodes NFS handle and file offset information into the device and block numbers it caches it's blocks under while real disk devices use their actual device and block numbers for caching blocks.",
        "example": "inASentencePlaceholder",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "21": {
        "word": "CSRF",
        "meaning": "Cross-Site Request Forgery (CSRF) is a type of attack that occurs when a malicious web site, email, blog, instant message, or program causes a user's web browser to perform an unwanted action on a trusted site for which the user is currently authenticated.",
        "example": "inASentencePlaceholder",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "22": {
        "word": "statusCode 500",
        "meaning": "Internal Server Error",
        "example": "inASentencePlaceholder",
        "tag": ["web", "DM"]
    },
    "23": {
        "word": "post request",
        "meaning": "one of many request methods supported by the HTTP protocol used by the World Wide Web. By design, the POST request method requests that a web server accepts and stores the data enclosed in the body of the request message. It is often used when uploading a file or submitting a completed web form.",
        "example": "Nodes connect module uses bodyParser() to prepare data. This is useful when using post requests",
        "tag": ["web", "CS", "DM"]
    },
    "24": {
        "word": "promise-chaining",
        "meaning": "I don't have your data yet, but I promise I will have it when call your data back on the function",
        "example": "inASentencePlaceholder",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "25": {
        "word": "MVC",
        "meaning": "Model View Controller",
        "example": "Model: REPRESENTATION & ORGANIZATION OF DATA...business logic & processing • View: Code that deals with user interface (UI) It decides what gets rendered and what it looks like--The UI shouldn't know how to change data • Controller: Between Model & View, it is the intermediary dealing with navigation & input",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "26": {
        "word": "Single-threaded Application",
        "meaning": "definitionPlaceHolder",
        "example": ".js is a Single-threaded Application.",
        "tag": ["tagPlaceHolder", "DM"]
    },
    "27": {
        "word": "CRUD",
        "meaning": "create, read, update, delete.",
        "example": "I really need to make a simple CRUD app",
        "tag": ["web", "CS", "DM"]
    },
    "28": {
        "word": "asynchronous",
        "meaning": "Start a fn. Tell it to execute...then move on to run and execute other javascript. I'll call that fn again when it's done doing its thing. Synchronous is to execute and wait...until it's performed all its stuff and then move on",
        "example": "Placeholder Text",
        "tag": ["CS", "web", "DM"]
    },
    "29": {
        "word": "web request",
        "meaning": "Any communication over the net to an api or to query data over the net",
        "example": "I need the proper syntax for this web request to get jquery",
        "tag": ["cs", "web", "DM"]
    },
    "30": {
        "word": "time-to-first-byte",
        "meaning": "(TTFB) is a measurement used as an indication of the responsiveness of a webserver or other network resource. TTFB measures the duration from the user or client making an HTTP request to the first byte of the page being received by the client's browser.",
        "example": "I need the proper syntax for this web request to get jquery",
        "tag": ["cs", "web", "DM"]
    },
    "31": {
        "word": "REST",
        "meaning": "A protocol. A set of rules. 'if this happens, we do this'--a set of guidelines for making web requests. GET, PUT, POST, DELETE are the CRUD of REST. PUT updates data while POST adds new data",
        "example": "GET, PUT, POST, DELETE are the four main rules (or methods) for REST",
        "tag": ["cs", "web", "DM"]
    },
    "32": {
        "word": "concurrency",
        "meaning": "Concurrency patterns are those types of design patterns that deal with the multi-threaded programming paradigm",
        "example": "Building an app, one day you will introduce some complex concurrency requests to facebook, etc.",
        "tag": ["web", "CS", "DM"]
    },
    "33": {
        "word": "expiate",
        "meaning": "atone for (guilt or sin)",
        "example": "their sins must be expiated by sacrifice",
        "tag": ["gre"]
    },
    "34": {
        "word": "poleax",
        "meaning": "hit, kill, or knock down with or as if with a poleax, to cause great shock to (someone).",
        "example": "I was poleaxed by this revelation",
        "tag": ["gre"]
    },
    "35": {
        "word": "bespoke",
        "meaning": "made to order, customized",
        "example": "this is a bespoke template for users of grunt",
        "tag": ["gre", "web", "DM"]
    },
    "36": {
        "word": "maieutic",
        "meaning": "of or denoting the Socratic mode of inquiry, which aims to bring a person's latent ideas into clear consciousness.",
        "example": "He teaches in a maieutic method whereby the student eventually wakes up to hisown understanding",
        "tag": ["gre"]
    },
    "37": {
        "word": "armistice",
        "meaning": "an agreement made by opposing sides in a war to stop fighting for a certain time; a truce.",
        "example": "armistice was declared on June 25th 1945",
        "tag": ["gre"]
    },
    "38": {
        "word": "bawdy",
        "meaning": "dealing with sexual matters in a comical way; humorously indecent.",
        "example": "His bawdy humour is not acceptable in an office setting",
        "tag": ["gre"]
    },
    "39": {
        "word": "bucolic",
        "meaning": "of or relating to the pleasant aspects of the countryside and country life.",
        "example": "He has shown a preference for bucolic scenery",
        "tag": ["gre"]
    },
    "40": {
        "word": "bromide",
        "meaning": "a platitude or trite saying.",
        "example": "He coughed behind the podium as if to choke on hisown bromides",
        "tag": ["gre"]
    },
    "41": {
        "word": "confute",
        "meaning": "to prove (a person) to be wrong by argument or proof:",
        "example": "This evidence confutes the claim that the economy is improving",
        "tag": ["gre"]
    },
    "42": {
        "word": "evanescence",
        "meaning": "to disappear gradually; vanish; fade away.",
        "example": "The evanescence of the clouds adds mystery to the transition from overcast to clear",
        "tag": ["gre"]
    },
    "43": {
        "word": "arbitrage",
        "meaning": "The purchase of securities on one market for immediate resale on another market in order to profit from a price discrepancy.",
        "example": "I'm buying it only to sell it on the principles of arbitrage.",
        "tag": ["gre"]
    },
    "44": {
        "word": "effervescence",
        "meaning": "to show enthusiasm, excitement, liveliness, etc.",
        "example": "Her lack of effervescence indicates that she wasn't entirely pleased with the result",
        "tag": ["gre"]
    },
    "45": {
        "word": "depredation",
        "meaning": "the act of preying upon or plundering; robbery; ravage.",
        "example": "The depredation of the weak and defenseless is the wont of people in power.",
        "tag": ["gre"]
    },
    "46": {
        "word": "insidious",
        "meaning": "intended to entrap or beguile; stealthily treacherous or deceitful; operating or proceeding in an inconspicuous or seemingly harmless way but actually with grave effect",
        "example": "The campaign to undermine the legitimacy of the polls was so insidious as to render their results moot while it's true purpose remains undetected",
        "tag": ["gre"]
    },
    "47": {
        "word": "traduce",
        "meaning": "to speak maliciously and falsely of; slander; defame:",
        "example": "You accuse me of traducing you, when I have done nothing other than list the facts!",
        "tag": ["gre"]
    },
    "48": {
        "word": "welter",
        "meaning": "n. a confused mass; a jumble or muddle; v. to roll, toss, writhe about; to be entangled or extensively involved in",
        "example": "Among the welter of seemingly useless data, these three facts are indicative of a significant and remarkable trend",
        "tag": ["gre"]
    },
    "49": {
        "word": "proviso",
        "meaning": "stipulation or condition",
        "example": "He agreed to the contract with the proviso that circumstances may prevent him from showing up at the office on time every day",
        "tag": ["gre"]
    },
    "50": {
        "word": "anodyne",
        "meaning": "not likely to provoke dissent or offense; inoffensive, often deliberately so.",
        "example": "She delivered an anodyne speech full of empty bromides that left us cold.",
        "tag": ["gre"]
    },
    "51": {
        "word": "succor",
        "meaning": "help; relief; aid; assistance.",
        "example": "The RedCross provides succor to the masses of displaced people around the world.",
        "tag": ["tagPlaceHolder"]
    },
    "52": {
        "word": "canard",
        "meaning": "a false or baseless, usually derogatory story, report, or rumor.",
        "example": "Let's just shoot that canard before it poops all over a truer understanding of the case!",
        "tag": ["gre"]
    },
    "53": {
        "word": "syncretism",
        "meaning": "the combination of different forms of belief or practice",
        "example": "He has a rather syncretic approach to learning in that he believes in both, a deep focus on one subject, and a broad dabbling, survey of the material generally.",
        "tag": ["gre"]
    },
    "54": {
        "word": "menagerie",
        "meaning": "a collection of animals kept especially to be shown to the public",
        "example": "He kept his images on the page as a kind of managerie to display to all who visited the site.",
        "tag": ["gre"]
    },
    "55": {
        "word": "toolchain",
        "meaning": " the set of programming tools that is used to perform a complex software development task or to create a software product. The toolchain may consist of a compiler and linker (which transform the source code into an executable program), libraries, and a debugger. ",
        "example": "There are some 7 or 8 steps in the DevOps toolchain in the software development lifecycle. https://en.wikipedia.org/wiki/DevOps_toolchain.",
        "tag": ["web", "DM"]
    },
    "56": {
        "word": "elegiac",
        "meaning": "mourning or expressing sorrow for that which is irrecoverably past",
        "example": "I have no time for your elegiac whining of your lost innocence",
        "tag": ["gre"]
    },
    "57": {
        "word": "arcana",
        "meaning": "deep secret, mystery. The specialized details unknown by others.",
        "example": "Coding appears to us all as a welter of arcana--opaque to the uninitiated, like the spells of the magi.",
        "tag": ["gre", "web"]
    },
    "58": {
        "word": "derecho",
        "meaning": "widespread, long-lived, straight-line wind storm that is associated with a land-based, fast-moving group of severe thunderstorms.",
        "example": "Confidence and belief his own cause served as a bulwark against the derecho of doubters and those who sought to malign him.",
        "tag": ["gre"]
    },
    "59": {
        "word": "perfidious",
        "meaning": "deceitful and untrustworthy, the deliberate breaking of faith; betrayal of trust; treachery",
        "example": "The lawyers' deliberate deceit of their clients and the subsequent profit from their demise belies their perfidious intent",
        "tag": ["gre"]
    },
    "60": {
        "word": "belie",
        "meaning": "to show (something) to be false or wrong",
        "example": "The suspect's body language spoke louder than than any of his words to belie the fact that he was, indeed, lying",
        "tag": ["gre"]
    },
    "61": {
        "word": "Bounded Rationality",
        "meaning": "Bounded rationality is the idea that when individuals make decisions, their rationality is limited by the available information, the tractability of the decision problem, the cognitive limitations of their minds, and the time available to make the decision.",
        "example": "As a boundedly rational user of the this software, often I don't use it in the most efficient way.",
        "tag": ["gre", "web", "DM"]
    },
    "62": {
        "word": "transpile",
        "meaning": "A source-to-source compiler, transcompiler or transpiler is a type of compiler that takes the source code of a program written in one programming language as its input and produces the equivalent source code in another programming language.",
        "example": "inASentencePlaceholder",
        "tag": ["CS", "web", "DM"]
    },
    "63": {
        "word": "function literal",
        "meaning": "A function with no name",
        "example": "Placeholder",
        "tag": ["web", "DM"]
    },
    "64": {
        "word": "Serialization",
        "meaning": "In the context of data storage, serialization is the process of translating data structures or object state into a format that can be stored or transmitted across a network connection and reconstructed later in the same or another environment",
        "example": "JSON is a js compatible serialization format",
        "tag": ["Web", "DM"]
    },
    "65": {
        "word": "Variadic Function",
        "meaning": " a variadic function takes varying number of arguments, not a set number of arguments as most functions do.",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "66": {
        "word": "Dynamically Typed",
        "meaning": "If a language allows for a single variable to store values of varying types then its variables are said to be 'dynamically typed.'",
        "example": "var myDyna = true; myDyna = 23; myDyna = 'bananas'; This is illustrative of DT languages.",
        "tag": ["Web", "DM"]
    },
    "67": {
        "word": "Conway's Law",
        "meaning": "Sofware built reflects the team that built it--or the communication systems generally used by the team that built it.",
        "example": "Placeholder",
        "tag": ["DM", "Web"]
    },
    "68": {
        "word": "Technical Debt",
        "meaning": "Technical debt or code debt is 'a concept in programming that reflects the extra development work that arises when code that is easy to implement in the short run is used instead of applying the best overall solution.",
        "example": "Technical debt can be compared to monetary debt. If technical debt is not repaid, it can accumulate 'interest', making it harder to implement changes later on.",
        "tag": ["DM", "Web", "CS"]
    },
    "69": {
        "word": "Deprecated",
        "meaning": "Declared non-standard and no longer used.",
        "example": "I pray for the day that activeX is deprecated.",
        "tag": ["Web", "DM"]
    },
    "70": {
        "word": "Type Coersion",
        "meaning": "send a num or a string into the params of a function & js will do the work. You don't have to declare int or double as in Java.",
        "example": "1 == '1';//true",
        "tag": ["DM", "Web"]
    },
    "71": {
        "word": "Code Smell",
        "meaning": "Code smell, also known as bad smell, in computer programming code, refers to any symptom in the source code of a program that possibly indicates a deeper problem. According to Martin Fowler, a code smell is a surface indication that usually corresponds to a deeper problem in the system. Another way to look at smells is with respect to principles and quality 'smells are certain structures in the code that indicate violation of fundamental design principles and negatively impact design quality'",
        "example": "Code smells are usually not bugs—they are not technically incorrect and do not currently prevent the program from functioning. Instead, they indicate weaknesses in design that may be slowing down development or increasing the risk of bugs or failures in the future. Bad code smells can be an indicator of factors that contribute to technical debt.",
        "tag": ["Web", "DM"]
    },
    "72": {
        "word": "FUD",
        "meaning": "Fear Doubt Uncertainty--Disinformation. Originating in marketing campaigns to intentionally to gain some kind of advantage over the competition.",
        "example": "Generally used to describe disinformation or misinformation in the computer hardware industry, and has since been used more broadly.",
        "tag": ["Web", "DM"]
    },
    "73": {
        "word": "Heuristic analysis",
        "meaning": "Looking at the design & interactions of an app and anaylizing how well those functions are working. Make assumptions on what someone was thinking when they decided to make a feature work the way it does in an app, ",
        "example": "Let's say you have a carousel on a page with dots beneath all the slides. The user will have to keep count or get lost. A Heuristic Improvement might be to replace those dots with numbers in order to minimize the cognitive load on the user. From those observations, we write the implications. '(ie) User gets lost! so here is how we might improve'",
        "tag": ["DM", "UX"]
    },
    "74": {
        "word": "roue",
        "meaning": "a debauched man, especially an elderly one.",
        "example": "As a roue he spent most of his money at the casinos with a prostitute on his arm and a drink in his hand.",
        "tag": ["GRE", "Placeholder"]
    },
    "75": {
        "word": "Temporal Dependency",
        "meaning": "When one thing depends upon another thing finishing before this thing can go",
        "example": "The only way to express this is by nesting callbacks.",
        "tag": ["Web", "DM"]
    },
    "76": {
        "word": "Race Condition",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "77": {
        "word": "Future Value",
        "meaning": "A value that--at some time--will become 'manifest' or fulfilled...In the meantime, as a promise, is something that we can 'operate on' and plan for prior to receiving this value.",
        "example": "Placeholder",
        "tag": ["DM", "Web"]
    },
    "78": {
        "word": "Action at a distance",
        "meaning": "[rethinking js asynch 02 promises api] Placeholder",
        "example": "Placeholder",
        "tag": ["DM", "Web"]
    },
    "79": {
        "word": "Event Delegation",
        "meaning": "Jquery and JS?",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "80": {
        "word": "Brio",
        "meaning": "vigor or vivacity of style or performance.",
        "example": "Placeholder",
        "tag": ["GRE", "Placeholder"]
    },
    "81": {
        "word": "Imbroglio",
        "meaning": "an extremely confused, complicated, or embarrassing situation.",
        "example": "ExamplePlaceholder",
        "tag": ["tagPlaceHolder", "tagPlaceHolder"]
    },
    "82": {
        "word": "tokenize the DOM",
        "meaning": "MeaningPlacholder",
        "example": "ExamplePlaceholder",
        "tag": ["web", "DM"]
    },
    "83": {
        "word": "reflow",
        "meaning": "recalculation of the DOM and the geometry of the page.",
        "example": "After an element is 'display: none'-ed there is no reflow. But adding a node, removing, animating, scrolling, tweaking style props, font, etc.",
        "tag": ["tagPlaceHolder", "tagPlaceHolder"]
    },
    "84": {
        "word": "shim",
        "meaning": "A sim (or shim layer) a shim is a small library that transparently intercepts API calls and changes the arguments passed, handles the operation itself, or redirects the operation elsewhere.[1][2] Shims can be used to support an old API in a newer environment, or a new API in an older environment. Shims can also be used for running programs on different software platforms than they were developed for.     Shims for older APIs typically come about when the behavior of an API changes, thereby causing compatibility issues for older applications which still rely on the older functionality; in such cases, the older API can still be supported by a thin compatibility layer on top of the newer code. Shims for newer APIs are defined as: 'a shim is a library that brings a new API to an older environment, using only the means of that environment.'",
        "example": "Paul Irish example of feature detecting browser requestAnimationFrame() or reverting to setTimeOut etc:  https://youtu.be/q_O9_C2ZjoA?t=1263",
        "tag": ["web", "DM"]
    },
    "85": {
        "word": "sheepish",
        "meaning": "(of a person or expression) showing embarrassment from shame or a lack of self-confidence.",
        "example": "He gave me a sheepish grin.",
        "tag": ["GRE"]
    },
    "86": {
        "word": "obloquy",
        "meaning": "strong public criticism or verbal abuse.",
        "example": "He endured years of contempt and obloquy",
        "tag": ["GRE"]
    },
    "87": {
        "word": "sang froid",
        "meaning": "composure or coolness, sometimes excessive, as shown in danger or under trying circumstances.",
        "example": "He demonstrated a surprising amount of sang froid despite the disastrous economic circumstances is family found itself.",
        "tag": ["GRE"]
    },
    "88": {
        "word": "Poe's Law",
        "meaning": "without a clear indicator of the author's intent, parodies of extreme views will be mistaken by some readers or viewers as sincere expressions of the parodied views",
        "example": "I told her she was 'pretty smart for a girl' and she took offense.",
        "tag": ["web", "GRE"]
    },
    "89": {
        "word": "Godwin's Law",
        "meaning": "As adiscussion grows longer, the probability of a comparison involving Nazis or Hitler approaches 1. Related to 'reductio ad Hitlerum' stating that 'if the Nazis liked X and you like X, then you are a Nazi.' (vegetarianism/atheism/narrow mustaches)",
        "example": "ExamplePlaceholder",
        "tag": ["tagPlaceHolder", "tagPlaceHolder"]
    },
    "90": {
        "word": "evergreen browser ",
        "meaning": "Edge 예를 들어서..",
        "example": "ExamplePlaceholder",
        "tag": ["tagPlaceHolder", "tagPlaceHolder"]
    },
    "91": {
        "word": "Function Currying",
        "meaning": "-----------",
        "example": "https://www.sitepoint.com/currying-in-functional-javascript/",
        "tag": ["tagPlaceHolder", "tagPlaceHolder"]
    },
    "92": {
        "word": "BEM",
        "meaning": "The Block, Element, Modifier methodology (commonly referred to as BEM) is a popular naming convention for classes in HTML and CSS.",
        "example": "/* Block component */.btn {}/* Element that depends upon the block */ .btn__price {}/* Modifier that changes the style of the block */.btn--orange {} .btn--big {}",
        "tag": ["DM", "WEB"]
    },
    "93": {
        "word": "recumbent",
        "meaning": ".",
        "example": "",
        "tag": ["DM", "WEB"]
    },
    "94": {
        "word": "Sweat equity",
        "meaning": " a party's contribution to a project in the form of effort and toil, as opposed to financial equity such as paying others to perform the task. Sweat equity has an application in business for example where the owners put in effort and toil to build the business, in real estate where owners can do D.I.Y. improvements and increase the value of the real estate and in other areas such as an auto owner putting in their own effort and toil to increase the value of the vehicle",
        "example": "",
        "tag": ["DM", "WEB"]
    },
    "93": {
        "word": "penitent",
        "meaning": "feeling or showing sorrow and regret for having done wrong; repentant.",
        "example": "",
        "tag": ["DM", "WEB"]
    },
    "93": {
        "word": "rictus",
        "meaning": "a fixed grimace or grin.",
        "example": "",
        "tag": ["DM", "WEB"]
    },
    "94": {
        "word": "Single responsibility principle",
        "meaning": ".",
        "example": "https://youtu.be/Gt0M_OHKhQE?t=477",
        "tag": ["DM", "WEB"]
    },
    "95": {
        "word": "asymptotic",
        "meaning": "An ever decreasing amount described by an ever flattening curve. A line that approaches a curve but never touches.",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "96": {
        "word": "Brackish",
        "meaning": "Unpleasant, distasteful",
        "example": "His brackish manner doesn't help him in the polls.",
        "tag": ["Placeholder", "GRE"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    },
    "Num": {
        "word": "Placeholder",
        "meaning": "Placeholder",
        "example": "Placeholder",
        "tag": ["Placeholder", "Placeholder"]
    }
}
